[{"name": "Asthma Plant", "original": "Euphorbia Hirta", "common": "Asthma Plant,Dove Milk,Garden Spurge,Hairy Spurge,Pillpod Sandmat,Pillpod Spurge,Red Euphorbia,Snakeweed,Sneezeweed,Sneeze Weed,Spurge", "hindi": "Bara Dudhi", "scifi": "Euphorbia Hirta", "link": "https://plants.ces.ncsu.edu/plants/euphorbia-hirta/", "use": "traditionally for female disorders, respiratory ailments (cough, coryza, bronchitis, and asthma), worm infestations in children, dysentery, jaundice, pimples, gonorrhea, digestive problems, and tumors", "info": "Spurges are annual weeds that flourish in warm weather, but in warmer climates, they can persist into late fall. Plants produce greenish-white flowers in summer through early fall, then die after frost. Spurges are some of the most common warm-season weeds in container nurseries. Also commonly known as Dove Milk, Euphorbia hirta exudes a milky sap when stems or leaves are broken."}, {"name": "Benghal dayflower", "original": "Tropical Spiderwort", "common": "Benghal dayflower, Tropical Spiderwort, or Wandering Jew, Kanshira in Bengali", "hindi": "Kana", "scifi": "Commelina benghalensis", "link": "https://en.wikipedia.org/wiki/Commelina_benghalensis", "use": "Leprosy, Sore throat, opthalmia, burns, pain and infammation and also used as de pressant, demulcent, emollient and laxative.", "info": " is a perennial herb native to tropical Asia and Africa. It has been widely introduced to areas outside its native range, including to the neotropics, Hawaii, the West Indies and to both coasts of North America. It has a long flowering period, from spring to fall in subtropical areas, and throughout the year closer to the equator.[7][8] It is often associated with disturbed soils."}, {"name": "Madagascar Periwinkle", "original": "Pink Periwinkle", "common": "bright eyes, Cape periwinkle, graveyard plant, Madagascar periwinkle, old maid, pink periwinkle, rose periwinkle", "hindi": "Sadabahar,Sadaphuli,Sadasuhagi", "scifi": "Catharanthus Roseus", "link": "https://en.wikipedia.org/wiki/Catharanthus_roseus", "use": "Relieving muscle pain, Depression of the central nervous system, applying to wasp stings and to heal wounds,treatment of stomach ache", "info": "C. roseus has been widely commercialized as an ornamental plant. Endangered in the wild, it is a fast-growing plant that is easy to cultivate. It is grown in gardens and parks worldwide and it has escaped from cultivation and naturalized near houses, in disturbed sites, and in natural habitats in seasonal dry and humid habitats. The species produces numerous small seeds that can be easily dispersed by ants, wind and water, but it can be also propagated vegetatively by cuttings (Sutarno and Rudjiman, 1999). C. roseus is listed as invasive in numerous countries in Asia, Africa, the Americas and Oceania."}, {"name": "Mexican Mint", "original": "Indian Mint", "common": "Bush Mint,Spearmint", "hindi": "Ajwain/Patharchur", "scifi": "Coleus Amboinicus", "link": "https://www.organicfacts.net/health-benefits/herbs-and-spices/indian-borage-mexican-mint.html", "use": "fever, cough, cold, asthma, migraines, and skin problems.", "info": "If you happen to stumble across a small green perennial plant in Africa that smells like Cuban oregano, there’s a good chance you’ve found Indian borage, which is also known by other names, such as Mexican Mint, Spanish thyme, country borage, and others. Although it is native to parts of southern and eastern Africa, the demand for this beneficial herb has caused cultivation to spread to other tropical areas around the world with suitable growing conditions. The plant, whose scientific name is Plectranthus amboinicus, is very hardy and grows quickly, requires little water, and can even grow in colder conditions if the weather changes dramatically."}]